Modules/Smatch/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>EuLisp Smatch module</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="November 2010"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">EuLisp Smatch module</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 EuLisp index </a></li>
<li><a href="#sec-3">3 General Description </a></li>
<li><a href="#sec-4">4 Definition </a></li>
<li><a href="#sec-5">5 Patterns </a></li>
<li><a href="#sec-6">6 Match Failure </a></li>
<li><a href="#sec-7">7 </a></li>
<li><a href="#sec-8">8 Installation </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="COPYING">Copyright</a> </h2>
<div class="outline-text-2" id="text-1">

<p>Youtoo is free software: you can redistribute it and/or modify it under the
terms of the GNU General Public License as published by the Free Software
Foundation, either version 2 of the License, or (at your option) any later
version.
</p>
<p>
Youtoo is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
A PARTICULAR PURPOSE.  See the GNU General Public License for more details.
</p>
<p>
You should have received a copy of the GNU General Public License along with
Youtoo in the file <a href="../../COPYING">COPYING</a>.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="../../index.html">EuLisp index</a> </h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Description </h2>
<div class="outline-text-2" id="text-3">

<p>Programmable pattern matcher based on <code>smatch.em</code> &ndash; portable hygienic pattern
matcher written by Alex Shinn, extended by Stefan Israelsson Tampe and
converted to EuLisp by Stefan Israelsson Tampe.  This is a full super-set of
the popular <code>match</code> package by Andrew Wright by written in itself and hence
requires bootstrapping.
</p>
<p>
This is a simple generative pattern matcher - each pattern is expanded into
the required tests, calling a failure continuation if the tests fail.  This
makes the logic easy to follow and extend, but produces sub-optimal code in
cases where you have many similar clauses due to repeating the same tests.
Nonetheless a smart compiler should be able to remove the redundant tests.
For <code>match-let</code> and <code>destructuring-bind</code> type uses there is no performance
hit.
</p>
<ul>
<li id="sec-3.1">Original: Portable hygienic pattern matcher <br/>
The original version was written on 2006/11/29 and described in the
following Usenet post:
<a href="http://groups.google.com/group/comp.lang.scheme/msg/0941234de7112ffd">http://groups.google.com/group/comp.lang.scheme/msg/0941234de7112ffd</a> and is
still available at <a href="http://synthcode.com/scheme/match-simple.scm">http://synthcode.com/scheme/match-simple.scm</a>. It's just
80 lines for the core MATCH, and an extra 40 lines for <code>match-let</code>,
<code>match-lambda</code> and other syntactic sugar.

<p>
A variant of this file which uses <code>cond-expand</code> in a few places for
performance can be found at
<a href="http://synthcode.com/scheme/match-cond-expand.scm">http://synthcode.com/scheme/match-cond-expand.scm</a>.
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Definition </h2>
<div class="outline-text-2" id="text-4">

<p>The complete syntax of the pattern matching expressions follows:
</p>


<pre class="src src-lisp">match expressions:
exp ::= ...
      | (match exp clause ...)
      | (match-lambda clause ...)
      | (match-lambda* clause ...)
      | (match-let ((pat exp) ...) body)
      | (match-let* ((pat exp) ...) body)
      | (match-letfuns ((pat exp) ...) body)
      | (defmatchfun pat exp)

clause ::= (pat body) | (pat =&gt; exp)
</pre>




<p>
The <code>match-lambda</code> and <code>match-lambda*</code> forms are convenient combinations of
<code>match</code> and <code>lambda</code>, and can be explained as follows:
</p>


<pre class="src src-lisp">(match-lambda (pat body) ...)   =  (<span style="color: #0000ff; font-weight: bold;">lambda</span> (x) (match x (pat body) ...))

(match-lambda* (pat body) ...)  =  (<span style="color: #0000ff; font-weight: bold;">lambda</span> x (match x (pat body) ...))
</pre>



<p>
where <code>x</code> is a unique variable. The <code>match-lambda</code> form is convenient when
defining a single argument function that immediately destructures its
argument. The <code>match-lambda*</code> form constructs a function that accepts any
number of arguments; the patterns of <code>match-lambda*</code> should be lists.  The
<code>match-let</code>, <code>match-let*</code>, <code>match-letfuns</code>, and <code>defmatchun</code> forms generalize
EuLisp's <code>let</code>, <code>let*</code>, <code>letfuns</code>, and <code>defun</code> expressions to allow patterns
in the binding position rather than just variables. For example, the
following expression:
</p>


<pre class="src src-lisp">(match-let (((x y z) (list 1 2 3))) $body$)
</pre>



<p>
binds <code>x</code> to 1, <code>y</code> to 2, and <code>z</code> to 3 in <code>body</code>. These forms are convenient
for destructuring the result of a function that returns multiple values. As
usual for <code>letfuns</code> and <code>defun</code>, pattern variables bound by <code>match-letfuns</code>
and <code>defmatchun</code> should not be used in computing the bound value.  The
<code>match</code>, <code>match-lambda</code>, and <code>match-lambda*</code> forms allow the optional
<code>syntax (=&gt; identifier)</code> between the pattern and the body of a clause. When
the pattern match for such a clause succeeds, the identifier is bound to a
failure procedure of zero arguments within the body. If this procedure is
invoked, it jumps back to the pattern matching expression, and resumes the
matching process as if the pattern had failed to match. The body must not
mutate the object being matched, otherwise unpredictable behavior may
result.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Patterns </h2>
<div class="outline-text-2" id="text-5">




<pre class="example">patterns:                               matches:

pat ::= identifier                      anything, and binds identifier
      | _                               anything
      | ()                              the empty list
      | t                               t
      | string                          a string
      | number                          a number
      | character                       a character
      | 'sexp                           an s-expression
      | 'symbol                         a symbol (special case of s-expr)
      | (pat_1 ... pat_n)               list of n elements
      | (pat_1 ... pat_n . pat_{n+1})   list of n or more
      | (pat_1 ... pat_n pat_n+1 ooo)   list of n or more, each element
                                        of remainder must match pat_n+1
      | #(pat_1 ... pat_n)              vector of n elements
      | #(pat_1 ... pat_n pat_n+1 ooo)  vector of n or more, each element
                                        of remainder must match pat_n+1
      | ($ class-name pat_1 ... pat_n)  a class
      | (= field pat)                   a field of a class
      | (and pat_1 ... pat_n)           if all of pat_1 thru pat_n match
      | (or pat_1 ... pat_n)            if any of pat_1 thru pat_n match
      | (not pat_1 ... pat_n)           if all pat_1 thru pat_n don't match
      | (? predicate pat_1 ... pat_n)   if predicate true and all of
                                        pat_1 thru pat_n match
      | (set identifier)                anything, and binds setter
      | (get identifier)                anything, and binds getter
      | `qp                             a quasi-pattern

ooo ::= ...                             zero or more
      | ___                             zero or more
      | (.. k)                          k or more
      | (__ k)                          k or more

quasi-patterns:                         matches:
qp  ::= ()                              the empty list
      | t                               t
      | ()                              ()
      | string                          a string
      | number                          a number
      | character                       a character
      | identifier                      a symbol
      | (qp_1 ... qp_n)                 list of n elements
      | (qp_1 ... qp_n . qp_{n+1})      list of n or more
      | (qp_1 ... qp_n qp_n+1 ooo)      list of n or more, each element
                                        of remainder must match qp_n+1
      | #(qp_1 ... qp_n)                vector of n elements
      | #(qp_1 ... qp_n qp_n+1 ooo)     vector of n or more, each element
                                        of remainder must match qp_n+1
      | ,pat                            a pattern
      | ,@pat                           a pattern
</pre>




<p>
The names <code>(quote, quasiquote, unquote, unquote-splicing, ?, _, $, and, or,   not, set, get, ..., ___)</code> cannot be used as pattern variables.
</p>
<ul>
<li id="sec-5.1"><i>identifier</i> <br/>
(excluding the reserved names <code>?</code>, <code>$</code>, <code>_</code>, <code>and</code>, <code>or</code>,
<code>not</code>, <code>set</code>, <code>get</code>, <code>...</code>, and <code>(..</code> <i>k</i> <code>)</code> for non-negative integers
<i>k</i>): matches anything, and binds a variable of this name to the matching
value in the body.
</li>
<li id="sec-5.2"><code>_</code> <br/>
matches anything, without binding any variables.
</li>
<li id="sec-5.3"><code>()</code>, <code>t</code>, <i>string</i>, <i>number</i>, <i>character</i>,  <i>​'s-expression</i> <br/>
These constant patterns match themselves, ie., the corresponding value
must be <code>equal?</code> to the pattern.
</li>
<li id="sec-5.4"><code>(</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches a proper list of <i>n</i> elements that match <i>pat<sub>1</sub></i> through
<i>pat<sub>n</sub></i>.
</li>
<li id="sec-5.5"><code>(</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub> . pat<sub>n+1</sub></i> <code>)</code> <br/>
matches a (possibly improper) list of at least <i>n</i> elements that ends in
something matching <i>pat<sub>n+1</sub></i>.
</li>
<li id="sec-5.6"><code>(</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub> pat<sub>n+1</sub> &hellip;</i> <code>)</code> <br/>
matches a proper list of <i>n</i> or more elements, where each element of the
tail matches <i>pat<sub>n+1</sub></i>.  Each pattern variable in <i>pat<sub>n+1</sub></i> is bound
to a list of the matching values. For example, the expression:



<pre class="src src-lisp">(match '(<span style="color: #0000ff; font-weight: bold;">let</span> ((x 1)(y 2)) z)
  (('let ((binding values) ...)  exp) body))
</pre>



<p>
binds binding to the list <code>​'(x y)</code>, values to the list <code>​'(1 2)</code>, and exp
to 'z in the body of the match- expression. For the special case where
<i>pat<sub>n+1</sub></i> is a pattern variable, the list bound to that variable may
share with the matched value.<br/>
</p></li>
<li id="sec-5.7"><code>(</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub> pat<sub>n+1</sub></i> <code>(..</code> <i>k</i> <code>))</code> <br/>
This pattern is similar to the previous pattern, but the tail must be at
least <i>k</i> elements long. The pattern keywords <code>(.. 0) and =...</code> are
equivalent.
</li>
<li id="sec-5.8"><code>#(</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches a vector of length <i>n</i>, whose elements match <i>pat<sub>1</sub></i> through
<i>pat<sub>n</sub></i>.
</li>
<li id="sec-5.9"><code>($</code> <i>class</i> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches a class declared with <code>defclass</code>.
</li>
<li id="sec-5.10"><code>(and</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches if all of the sub-patterns match. This pattern is often used as
<code>(and</code> <i>x pat</i> <code>)</code> to bind <i>x</i> to the entire value that matches <i>pat</i>
(cf. "as-patterns" in ML or Haskell).
</li>
<li id="sec-5.11"><code>(or</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches if any of the sub-patterns match. At least one subpattern must be
present.  All sub-patterns must bind the same set of pattern variables.
</li>
<li id="sec-5.12"><code>(not</code> <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
matches if none of the sub-patterns match. The sub-patterns may not bind
any pattern variables.
</li>
<li id="sec-5.13"><code>(?</code> <i>predicate pat<sub>1</sub> &hellip; pat<sub>n</sub></i> <code>)</code> <br/>
In this pattern, predicate must be an expression evaluating to a single
argument function. This pattern matches if predicate applied to the
corresponding value is true, and the sub-patterns <i>pat<sub>1</sub> &hellip; pat<sub>n</sub></i>
all match. The predicate should not have side effects, as the code
generated by the pattern matcher may invoke predicates repeatedly in any
order. The predicate expression is bound in the same scope as the match
expression, <i>i.e.</i>, free variables in predicate are not bound by pattern
variables.
</li>
<li id="sec-5.14"><code>(set</code> <i>identifier</i> <code>)</code> <br/>
matches anything, and binds identifier to a procedure of one argument that
mutates the corresponding field of the matching value. This pattern must
be nested within a pair, vector or class pattern. For example,
the expression:



<pre class="src src-lisp">(define x (list 1 (list 2 3)))
(match x ((_ (_ (set setit))) (setit 4)))
</pre>



<p>
mutates the <code>cadadr</code> of <code>x</code> to 4, so that <code>x</code> is <code>​'(1 (2 4))</code>.
</p></li>
<li id="sec-5.15"><code>(get</code> <i>identifier</i> <code>)</code> <br/>
matches anything, and binds identifier to a procedure of zero arguments
that accesses the corresponding field of the matching value. This pattern
is the complement to <code>set</code>.  As with <code>set</code>, this pattern must be nested
within a pair, vector, or class pattern.
</li>
<li id="sec-5.16">Quasipatterns <br/>
Quasiquote introduces a quasipattern, in which identifiers are considered
to be symbolic constants. Like Scheme's quasiquote for data, <code>unquote</code>
(=,=) and <code>unquote-splicing</code> (=,@=) escape back to normal patterns.

</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Match Failure </h2>
<div class="outline-text-2" id="text-6">


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="todo TODO"> TODO</span>  </h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>
Complete support of classes
</li>
<li>
Complete set of tests

</li>
</ul>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Installation </h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>
Run 'make' in directory <i>Modules/Smatch</i>.
</li>
<li>
Run 'make test' in directory <i>Modules/Smatch</i>.
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author:
<a href="mailto:no-reply">&lt;no-reply&gt;</a>
</p>
<p class="date"> Date: November 2010</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
